Examinator/src/InformationRegisters/ВремяДоступаПользователейСУО/ВремяДоступаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяДоступаПользователейСУО</name>
  <attributes>
    <name>ДатаНачалаДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВремяДоступаПользователейСУО/Forms/ФормаЗапретВхода/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатыДоступа = РегистрыСведений.ВремяДоступаПользователейСУО.ДатыДоступа(Параметры.Пользователь);
	
	Если ДатыДоступа = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДатаНачалаДоступа = ДатыДоступа.ДатаНачалаДоступа;
	ДатаОкончанияДоступа = ДатыДоступа.ДатаОкончанияДоступа;

	Если ЗначениеЗаполнено(ДатаНачалаДоступа)
		И ЗначениеЗаполнено(ДатаОкончанияДоступа) Тогда
		
		Элементы.ГруппаДвеДаты.Видимость = Истина;
		Элементы.ГруппаДатаНачала.Видимость = Ложь;
		Элементы.ГруппаДатаОкончания.Видимость = Ложь;
		
	Иначе
		
		Элементы.ГруппаДвеДаты.Видимость = Ложь;
		Элементы.ГруппаДатаНачала.Видимость = ?(ЗначениеЗаполнено(ДатаНачалаДоступа), Истина, Ложь);
		Элементы.ГруппаДатаОкончания.Видимость = ?(ЗначениеЗаполнено(ДатаОкончанияДоступа), Истина, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
